In [1]:
import pandas as pd

# Creating two example DataFrames
left_df = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
})

right_df = pd.DataFrame({
    'ID': [2, 3, 4],
    'Salary': [50000, 60000, 70000],
    'Department': ['HR', 'IT', 'Finance']
})

In [2]:
left_df

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35

In [3]:
right_df

   ID  Salary Department
0   2   50000         HR
1   3   60000         IT
2   4   70000    Finance

In [4]:
# Inner Join
result_inner = pd.merge(left_df, right_df, how='inner', on='ID')
print("Inner Join:")
print(result_inner)

Inner Join:
   ID     Name  Age  Salary Department
0   2      Bob   30   50000         HR
1   3  Charlie   35   60000         IT

In [5]:
# Left Join
result_left = pd.merge(left_df, right_df, how='left', on='ID')
print("Left Join:")
print(result_left)

Left Join:
   ID     Name  Age   Salary Department
0   1    Alice   25      NaN        NaN
1   2      Bob   30  50000.0         HR
2   3  Charlie   35  60000.0         IT

In [6]:
# Right Join
result_right = pd.merge(left_df, right_df, how='right', on='ID')
print("Right Join:")
print(result_right)

Right Join:
   ID     Name   Age  Salary Department
0   2      Bob  30.0   50000         HR
1   3  Charlie  35.0   60000         IT
2   4      NaN   NaN   70000    Finance

In [7]:
# Outer Join
result_outer = pd.merge(left_df, right_df, how='outer', on='ID')
print("Outer Join:")
print(result_outer)

Outer Join:
   ID     Name   Age   Salary Department
0   1    Alice  25.0      NaN        NaN
1   2      Bob  30.0  50000.0         HR
2   3  Charlie  35.0  60000.0         IT
3   4      NaN   NaN  70000.0    Finance